Config = {}

-- الأزرار الممنوعة
-- عشان تاخذ ارقام الازرار: https://docs.fivem.net/docs/game-references/controls/
Config["الأزرار الممنوعة"] = {
    [21] = true, -- الجري
    [22] = true, -- القفز
    [37] = true, -- عجلة الأسلحة
    [45] = true, -- إعادة تحميل
    [24] = true, -- اللكم
    [69] = true, -- الهجوم القتالي (الأول)
    [92] = true, -- الهجوم القتالي (الثانوي)
    [106] = true, -- الضرب بالسلاح
    [140] = true, -- إعادة تحميل والهجوم القتالي
    [141] = true  -- الطعن بالسكين
}

-- الوظائف الي مايجيها قدرات محدودة

Config["الوظائف"] = {
    ["admin"] = true,
    ["police"] = true,
    ["agent"] = true
    ["ambulance"] = true
}

-- الوقت الافتراضي في الحالة المقيدة
Config["الوقت الافتراضي"] = 30  -- الوقت الافتراضي للحالة المقيدة بالثواني


Config["سرعة المركبة"] = 9.0  -- حد السرعة الخاص بالسيارة